Проект_Услуги/src/Documents/НачисленияСотрудникам/НачисленияСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачисленияСотрудникам</name>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВидыГрафиковРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Проект_Услуги/src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>Перерасчет</name>
    <dimensions>
      <name>Сотрудник</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

Проект_Услуги/src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Невыход</name>
      <description>Невыход</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

Проект_Услуги/src/Documents/НачисленияСотрудникам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
		Движение.БазовыйПериодНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец = ТекСтрокаНачисления.ДатаОкончания;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
		Движение.ИсходныеДанные = ТекСтрокаНачисления.Начислено;
	КонецЦикла;
	
	Движения.Начисления.Записать();
	
	// Получение списка сотрудников из таблицы документа
	Запрос = Новый Запрос(
		 "ВЫБРАТЬ РАЗЛИЧНЫЕ
		 | НачисленияСотрудникамНачисления.Сотрудник
		 |ИЗ
		 | Документ.НачисленияСотрудникам.Начисления КАК 
		 |      НачисленияСотрудникамНачисления
		 |
		 |ГДЕ
		 | НачисленияСотрудникамНачисления.Ссылка = &ТекущийДокумент");
		 
	 Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	// Сформировать список сотрудников
	ТаблЗнач = Запрос.Выполнить().Выгрузить();
	МассивСотрудников = ТаблЗнач.ВыгрузитьКолонку("Сотрудник");
	
	// Вызов процедуры "РассчитатьНачисления" из общего модуля
	ПроведениеРасчетов.РассчитатьНачисления(Движения.Начисления, 
				ПланыВидовРасчета.ОсновныеНачисления.Оклад, МассивСотрудников);
	Движения.Начисления.Записать( , Истина);
	
	ПроведениеРасчетов.РассчитатьНачисления(Движения.Начисления, 
				ПланыВидовРасчета.ОсновныеНачисления.Премия, МассивСотрудников);
	Движения.Начисления.Записать( , Истина);
	
		
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
